ACS - Class Wide Projects/SSD Performance Profiling/Block-size & Pattern Sweep/bsweep_randread.txt
randread_4k: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
randread_16k: (g=1): rw=randread, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=libaio, iodepth=1
randread_32k: (g=2): rw=randread, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=1
randread_64k: (g=3): rw=randread, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=1
randread_128k: (g=4): rw=randread, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
randread_256k: (g=4): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=1
fio-3.28
Starting 6 processes

randread_4k: (groupid=0, jobs=1): err= 0: pid=10587: Mon Sep 29 23:54:30 2025
  read: IOPS=1639, BW=6558KiB/s (6715kB/s)(128MiB/20001msec)
    slat (nsec): min=1011, max=197534, avg=8872.70, stdev=6427.04
    clat (usec): min=260, max=7924, avg=597.94, stdev=106.00
     lat (usec): min=263, max=7954, avg=606.99, stdev=106.22
    clat percentiles (usec):
     |  50th=[  603],  95th=[  734],  99th=[  824]
    lat percentiles (usec):
     |  50th=[  611],  95th=[  742],  99th=[  840]
   bw (  KiB/s): min= 6124, max= 6885, per=100.00%, avg=6564.46, stdev=171.16, samples=39
   iops        : min= 1531, max= 1721, avg=1641.08, stdev=42.76, samples=39
  lat (usec)   : 500=16.22%, 750=80.41%, 1000=3.33%
  lat (msec)   : 2=0.02%, 4=0.01%, 10=0.01%
  cpu          : usr=1.33%, sys=3.36%, ctx=33340, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=32790,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
randread_16k: (groupid=1, jobs=1): err= 0: pid=10610: Mon Sep 29 23:54:30 2025
  read: IOPS=1265, BW=19.8MiB/s (20.7MB/s)(396MiB/20001msec)
    slat (nsec): min=1172, max=278064, avg=9267.95, stdev=6072.53
    clat (usec): min=351, max=11195, avg=778.03, stdev=143.51
     lat (usec): min=352, max=11220, avg=787.47, stdev=143.68
    clat percentiles (usec):
     |  50th=[  799],  95th=[  988],  99th=[ 1074]
    lat percentiles (usec):
     |  50th=[  807],  95th=[  996],  99th=[ 1090]
   bw (  KiB/s): min=16960, max=23328, per=100.00%, avg=20255.72, stdev=2197.45, samples=39
   iops        : min= 1060, max= 1458, avg=1265.90, stdev=137.29, samples=39
  lat (usec)   : 500=1.25%, 750=42.18%, 1000=53.22%
  lat (msec)   : 2=3.35%, 20=0.01%
  cpu          : usr=0.92%, sys=2.82%, ctx=26007, majf=0, minf=17
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=25316,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
randread_32k: (groupid=2, jobs=1): err= 0: pid=10635: Mon Sep 29 23:54:30 2025
  read: IOPS=1177, BW=36.8MiB/s (38.6MB/s)(736MiB/20001msec)
    slat (nsec): min=1320, max=132229, avg=8708.53, stdev=4601.13
    clat (usec): min=480, max=8236, avg=838.05, stdev=107.59
     lat (usec): min=484, max=8267, avg=846.91, stdev=107.56
    clat percentiles (usec):
     |  50th=[  832],  95th=[  963],  99th=[ 1074]
    lat percentiles (usec):
     |  50th=[  840],  95th=[  971],  99th=[ 1074]
   bw (  KiB/s): min=35776, max=40576, per=100.00%, avg=37688.41, stdev=1528.41, samples=39
   iops        : min= 1118, max= 1268, avg=1177.69, stdev=47.76, samples=39
  lat (usec)   : 500=0.07%, 750=16.03%, 1000=81.26%
  lat (msec)   : 2=2.63%, 4=0.01%, 10=0.01%
  cpu          : usr=0.65%, sys=2.66%, ctx=23873, majf=0, minf=21
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=23555,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
randread_64k: (groupid=3, jobs=1): err= 0: pid=10648: Mon Sep 29 23:54:30 2025
  read: IOPS=864, BW=54.0MiB/s (56.7MB/s)(1081MiB/20001msec)
    slat (nsec): min=1859, max=131453, avg=10265.03, stdev=4506.84
    clat (usec): min=743, max=10150, avg=1143.82, stdev=127.50
     lat (usec): min=752, max=10193, avg=1154.24, stdev=129.02
    clat percentiles (usec):
     |  50th=[ 1139],  95th=[ 1254],  99th=[ 1418]
    lat percentiles (usec):
     |  50th=[ 1156],  95th=[ 1270],  99th=[ 1434]
   bw (  KiB/s): min=52864, max=60672, per=100.00%, avg=55396.10, stdev=2249.94, samples=39
   iops        : min=  826, max=  948, avg=865.41, stdev=35.17, samples=39
  lat (usec)   : 750=0.01%, 1000=9.03%
  lat (msec)   : 2=90.95%, 4=0.01%, 20=0.01%
  cpu          : usr=0.71%, sys=2.04%, ctx=17575, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=17292,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
randread_128k: (groupid=4, jobs=2): err= 0: pid=10652: Mon Sep 29 23:54:30 2025
  read: IOPS=416, BW=77.8MiB/s (81.6MB/s)(1557MiB/20004msec)
    slat (usec): min=2, max=3169, avg=22.79, stdev=76.62
    clat (usec): min=1339, max=11586, avg=4769.41, stdev=493.47
     lat (usec): min=1342, max=11597, avg=4792.55, stdev=494.57
    clat percentiles (usec):
     |  50th=[ 4817],  95th=[ 5211],  99th=[ 5604]
    lat percentiles (usec):
     |  50th=[ 4817],  95th=[ 5211],  99th=[ 5800]
   bw (  KiB/s): min=75879, max=87150, per=99.96%, avg=79672.33, stdev=1181.73, samples=78
   iops        : min=  394, max=  464, avg=416.00, stdev= 7.23, samples=78
  lat (msec)   : 2=1.16%, 4=0.61%, 10=98.21%, 20=0.01%
  cpu          : usr=0.33%, sys=0.76%, ctx=9740, majf=0, minf=123
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=8336,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=6558KiB/s (6715kB/s), 6558KiB/s-6558KiB/s (6715kB/s-6715kB/s), io=128MiB (134MB), run=20001-20001msec

Run status group 1 (all jobs):
   READ: bw=19.8MiB/s (20.7MB/s), 19.8MiB/s-19.8MiB/s (20.7MB/s-20.7MB/s), io=396MiB (415MB), run=20001-20001msec

Run status group 2 (all jobs):
   READ: bw=36.8MiB/s (38.6MB/s), 36.8MiB/s-36.8MiB/s (38.6MB/s-38.6MB/s), io=736MiB (772MB), run=20001-20001msec

Run status group 3 (all jobs):
   READ: bw=54.0MiB/s (56.7MB/s), 54.0MiB/s-54.0MiB/s (56.7MB/s-56.7MB/s), io=1081MiB (1133MB), run=20001-20001msec

Run status group 4 (all jobs):
   READ: bw=77.8MiB/s (81.6MB/s), 77.8MiB/s-77.8MiB/s (81.6MB/s-81.6MB/s), io=1557MiB (1633MB), run=20004-20004msec

Disk stats (read/write):
  sda: ios=107175/0, merge=0/0, ticks=110798/0, in_queue=110798, util=90.79%